#1 '얼른 마스크'씨 회사 전기자동차의 행복한 일련번호
# https://euler.synap.co.kr/quiz=1




"""
마스크를 쓰지 않고는 밖을 다니면 안 되는 코로나19 시대입니다.
코로나19가 장기화되면서 코로나 블루라는 말이 나올 정도로 우울한 사람들이 많아지고 있습니다.

세계적인 전기자동차 회사 경영자인 '얼른 마스크'씨는
자신의 전기자동차를 타는 고객들이 조금이라도 행복할 수 있기를 바라며
판매하는 전기자동차 번호판 일련번호 4자리를 행복 수(happy number)로 채우고자 합니다.

행복 수는 각 자릿수의 제곱의 합으로 변환하는 과정을 반복할 때 언젠가는 1에 도달하는 수입니다.
예로, 13 → 1x1 + 3x3 = 10 → 1x1 + 0x0 = 1이므로 13은 행복 수입니다.

행복 수가 아닌 것은 슬픈(sad) 수 또는 불행(unhappy) 수라고 불립니다.
예로, 4 → 4x4 = 16 → 1x1 + 6x6 = 37 → 3x3 + 7x7 = 58 → ... → 4 로 순환하여 결코 1에 도달할 수 없으니 4는 슬픈 수입니다.

문제
'얼른 마스크'씨 회사 전기자동차의 일련번호가 될 수 있는 1 ~ 9999 범위의 행복 수는 모두 몇 개이고
그 총합은 얼마인지 구하는 프로그램을 작성해서 보내주세요 작성하세요.

입력
각 범위의 최댓값을 한 줄에 하나씩 입력으로 받습니다. 최종적으로 구하고자 하는 범위의 최댓값은 9999이므로 소스코드 안에 하드코딩 해도 됩니다.
9
99
출력
범위와 행복 수의 개수 그리고 총합을 아래와 같이 출력합니다.
1 ~ 9 범위의 행복 수는 2개이고 총합은 8입니다.
1 ~ 99 범위의 행복 수는 19개이고 총합은 924입니다.
참고
프로젝트 오일러 92번은 행복 수에 대한 조금 더 어려운 문제입니다.
https://euler.synap.co.kr/problem=92

출처) 사이냅소프트 채용퀴즈

아래 정답란에는..
1 ~ 9 범위의 행복 수는 2개이고 총합은 8이므로 두 수의 곱은 16입니다. 1 ~ 9999 범위의 행복 수의 개수와 총합을 구하여 두 수의 곱을 제출하세요.

"""





#2 축전기 회로의 개수
#https://euler.synap.co.kr/problem=155


###### 그림이 첨부되지 않았습니다. 사이트에서 문제를 확인해보세요 ########


"""

동일한 저장용량 C값을 갖는 같은 종의 축전기로만 전기회로를 구성합니다.
축전기를 직렬 또는 병렬로 연결하여 하위모듈을 만들고, 이를 다시 다른 축전기나 다른 하위모듈과 직렬 또는 병렬로 연결하는 작업을 계속하여 최종 전기회로를 만듭니다.

n개의 동일한 축전기에 이 방법을 적용하면 여러가지 총 저장용량을 가진 회로를 만들 수 있습니다. 예를 들어, 저장용량 60 F 의 축전기 n=3 개를 사용하면 다음과 같은 일곱 가지의 서로 다른 총 저장용량을 만들 수 있습니다:


D(n)을 동일한 축전기 n개를 이용해 만들 수 있는 서로 다른 총 저장용량의 가짓수라고 하면: D(1)=1, D(2)=3, D(3)=7 ... 입니다.

D(18)의 값을 구하세요.

이미 아시겠지만 : 축전기 C1, C2, ... 를 병렬로 연결하면 총 저장용량은 CT = C1 + C2 +... 이고,
직렬로 연결하면, 전체 저장용량은 1CT=1C1+1C2+...
 입니다.
 
"""
