########################## 10_02 ####################################
#  study Q_1)
# 과제문제 15) 함수 divide(x, y) 함수를 구현한 후 연산 0으로 나누는 것에 대한 예외 처리를 수행하도록 하시오.
#    - 구문은 try, except, else 블록 구현
#   - 다음 두 호출에 대한 결과

# def divide(x, y):
#     try:
#         answer = x / y              #변수입력
#     except ZeroDivisionError:       #예외발생
#         return "Error"
#     else:                           #예외발생 X
#         return answer

# x = float(input("x를 입력해주세요: "))
# y = float(input("x를 입력해주세요: "))
# print(divide(x,y))



#  study Q_2) 
# 10보다 작은 자연수 중에서 3 또는 5의 배수는 3, 5, 6, 9 이고, 이것을 모두 더하면 23입니다.
#        1000보다 작은 자연수 중에서 3 또는 5의 배수를 모두 더하면 얼마일까요?

# 1000보다 작은 자연수 중 3 또는 5의 배수의 합을 구하는 코드

# my_list = range(1,1000)
# total = 0

# for a in my_list:
#     if a % 3 == 0 or a % 5 == 0:
#         total += a

# print(total)

#  study Q_3)
#  문자열 형식으로 입력 받은 모스코드(dot: . dash:-)를 해독하여 영어 문장으로 출력하는 프로그램을 작성하시오.
#  글자와 글자 사이는 공백 하나, 단어와 단어 사이는 공백 두개로 구분한다.
 
#     예를 들어 다음 모스부호는 "he sleeps early"로 해석해야 한다.
#          -->  .... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--
#  """
# #참고 Source
# dic={'.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
#        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
#        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
#        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
#        '-.--':'y','--..':'z','':' '}

#  글자와 글자 사이는 공백 하나
#  단어와 단어 사이는 공백 두개

# 모르겠어요 ㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠㅠ

# dic={'.-':'a','-...':'b','-.-.':'c','-..':'d','.':'e','..-.':'f',
#        '--.':'g','....':'h','..':'i','.---':'j','-.-':'k','.-..':'l',
#        '--':'m','-.':'n','---':'o','.--.':'p','--.-':'q','.-.':'r',
#        '...':'s','-':'t','..-':'u','...-':'v','.--':'w','-..-':'x',
#        '-.--':'y','--..':'z','':' '}

# a = input("문자열을 입력해주세요: ")
# words = a.split("  ")

# my_list=[]

# for word in words:
#     for text1 in words:
#         my_list.append(text1)

#     my_list.append(" ".join(text1))

# print(my_list)
