#7차시_ 22번문제

 # 학생들의 성적을 딕셔너리로 저장하고, 평균 점수를 계산하여 출력하는 프로그램을
 # 작성하시오. 예를 들어, {'John': 85, 'Jane': 92, 'Dave': 78}이라는 데이터가 주어지면, 
 # 이 학생들의 평균 점수를 출력하는 프로그램을 구성 하시오
 
# score={'John': 85, 'Jane': 92, 'Dave': 78}

 
# def solution(scores):
#     average= sum(scores.values())/len(scores)
#     return average

# print(solution(score))

  # 85.0     
        
 #===========================================================================================================================================================
 
 
# 14차시_18번문제



# 파이썬의 datetime 모듈을 사용하여 현재 날짜와 시간을 출력하는 프로그램을 작성하시오.



# from datetime import datetime

# print(datetime.now())


#===========================================================================================================================================================

# 코딩테스트 연습_월간 코드 챌린지 시즌1_3진법 뒤집기
#출처_https://school.programmers.co.kr/learn/courses/30/lessons/68935

# 자연수 n이 매개변수로 주어집니다. n을 3진법 상에서 앞뒤로 뒤집은 후,
# 이를 다시 10진법으로 표현한 수를 return 하도록 solution 함수를 완성해주세요.


# @제한사항@
# n은 1 이상 100,000,000 이하인 자연수입니다.

#입출력 예

# n   | result
# -------------
# 45  | 7
# 125 | 229


# 입출력 예 #1
#--------------------------------------------------------------
# 답을 도출하는 과정은 다음과 같습니다.

# n (10진법)   \n (3진법)   \앞뒤 반전(3진법) \10진법으로 표현
#      45	    \   1200	 \      0021	     \   7
# 
# 따라서 7을 return 해야 합니다.
# 
#--------------------------------------------------------------- 
# 입출력 예 #2

# 답을 도출하는 과정은 다음과 같습니다.
# n (10진법)    \ (3진법)	   \  앞뒤 반전(3진법) \	10진법으로 표현
# 125	         \ 11122	    \   22111	        \      229





def solution(n):
    J=""
    while n > 0:
        J += str(n%3)
        n = n//3
    """
    j2=J[::-1] # n은 뒤집혀서 출력 되어있음 3진법으로 변환
    
    
    for i in range(len(answer)):        # 찾아봤음
        result += (int(answer[i]) * 3**i
     """          
    answer = int(J,3)  
    return answer       #헐...

solution(45)
solution(1200)
